# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn=sqlite3.connect('data.sqlite')
c=conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [7]:
#Your code here
results=pd.DataFrame(c.execute("""SELECT lastName,firstName FROM employees JOIN offices using(officeCode);""").fetchall())
results.columns=[x[0] for x in c.description]
results.head()

    lastName firstName
0     Murphy     Diane
1  Patterson      Mary
2   Firrelli      Jeff
3  Patterson   William
4     Bondur    Gerard

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [35]:
#Your code here
results=pd.DataFrame(c.execute("""SELECT officeCode,count(*) as employees_in_office
                                  FROM employees 
                                  JOIN offices 
                                  using(officeCode) 
                                  GROUP BY officeCode
                                  HAVING employees_in_office=0;""").fetchall())
results

Empty DataFrame
Columns: []
Index: []

## Write 3 Questions of your own and answer them

### Question 1: How many products are sold in each order?

In [37]:
# Your code here
results=pd.DataFrame(c.execute("""SELECT orderNumber,count(productCode)
                                  FROM orderdetails
                                  JOIN products
                                  using(productCode)
                                  GROUP BY orderNumber;""").fetchall())
results.columns=[x[0] for x in c.description]
results.head()

  orderNumber  count(productCode)
0       10100                   4
1       10101                   4
2       10102                   2
3       10103                  16
4       10104                  13

### Question 2: Customers in which state place the most orders?

In [41]:
# Your code here
results=pd.DataFrame(c.execute("""SELECT state,count(orderNumber) as num_of_orders 
                                 FROM customers 
                                 JOIN orders using(customerNumber) 
                                 GROUP BY state 
                                 ORDER BY num_of_orders DESC;""").fetchall())
results.columns=[x[0] for x in c.description]
results.head(10)

      state  num_of_orders
0                      180
1        CA             45
2        MA             23
3        NY             18
4        PA              9
5        CT              8
6       NSW              8
7  Victoria              8
8        BC              4
9     Tokyo              4

### Question 3: How much has each customer been charged?

In [48]:
results=pd.DataFrame(c.execute("""SELECT customerNumber,sum(amount)
                                  FROM customers
                                  JOIN payments using(customerNumber)
                                  GROUP BY customerNumber""").fetchall())
results.columns=[x[0] for x in c.description]
results.head()

  customerNumber  sum(amount)
0            103     22314.36
1            112     80180.98
2            114    180585.07
3            119    116949.68
4            121    104224.79

## Level Up: Display the names of each product each employee has sold

In [60]:
# Your code here
results=pd.DataFrame(c.execute("""SELECT employees.lastName,employees.firstName,products.productName
                                  FROM employees
                                  JOIN customers on employees.employeeNumber=customers.SalesRepEmployeeNumber
                                  JOIN orders using(customerNumber)
                                  JOIN orderdetails using(orderNumber)
                                  JOIN products using(productCode)
                                  """).fetchall())
results.columns=[x[0] for x in c.description]
results.head()

   lastName firstName                                  productName
0  Jennings    Leslie                               1958 Setra Bus
1  Jennings    Leslie                       1940 Ford Pickup Truck
2  Jennings    Leslie                      1939 Cadillac Limousine
3  Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings    Leslie                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [62]:
#Your code here
results=pd.DataFrame(c.execute("""SELECT employees.lastName,employees.firstName,sum(orderdetails.quantityOrdered) as num_items_sold
                                  FROM employees
                                  JOIN customers on employees.employeeNumber=customers.SalesRepEmployeeNumber
                                  JOIN orders using(customerNumber)
                                  JOIN orderdetails using(orderNumber)
                                  GROUP BY employeeNumber
                                  """).fetchall())
results.columns=[x[0] for x in c.description]
results.head()

    lastName firstName  num_items_sold
0   Jennings    Leslie           11854
1   Thompson    Leslie            4056
2   Firrelli     Julie            4227
3  Patterson     Steve            5561
4      Tseng  Foon Yue            5016

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!